input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 227
  dim: 227
}
force_backward: true
layer {
  name: "laplace"
  type: "Convolution"
  bottom: "data"
  top: "laplace"
  convolution_param {
    num_output: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: CAFFE
  }
}
